## IMPORTING AND LOADING DATASET

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Employee_Dataset.csv')
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,invalid,01/04/2021,5,3,NaN
1,emp_1,IT,Analyst,NaN,55000,10/06/2020,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaN,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,invalid,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaN,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,invalid,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021/07/15,invalid,3,excellent,yes
998,emp_998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,invalid,2022-03-01,ten,5,yes

## 1.Convert joining_date to datetime and count how many rows failed conversion

In [3]:
df["joining_date"].unique()

array(['invalid', '10/06/2020', nan, '2019-05-10', '2021/07/15'],
      dtype=object)

In [4]:
df['joining_date']=pd.to_datetime(df['joining_date'],errors='coerce',dayfirst=True)
df

C:\Users\keert\AppData\Local\Temp\ipykernel_2948\2807255247.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['joining_date']=pd.to_datetime(df['joining_date'],errors='coerce',dayfirst=True)

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,NaT,01/04/2021,5,3,NaN
1,emp_1,IT,Analyst,NaN,55000,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaT,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,NaT,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021-07-15,invalid,3,excellent,yes
998,emp_998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,NaT,2022-03-01,ten,5,yes

In [5]:
k=sum(df['joining_date'].value_counts())
print("rows failed conversion:",1000-k)

rows failed conversion: 377

## 2.Clean employee_id and identify how many duplicate employees exist after 
standardization

In [6]:
k=df["employee_id"].unique()
len(k)

497

In [7]:
df["employee_id"]=df["employee_id"].str.upper()
k=df["employee_id"].unique()
len(k)

497

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   employee_id          496 non-null    object
 1   department           866 non-null    object
 2   designation          833 non-null    object
 3   age                  900 non-null    object
 4   salary               756 non-null    object
 5   joining_date         623 non-null    datetime64[ns]
 6   last_promotion_date  756 non-null    object
 7   experience_years     886 non-null    object
 8   performance_rating   872 non-null    object
 9   is_active            796 non-null    object
dtypes: datetime64[ns](1), object(9)
memory usage: 78.2+ KB

In [9]:
df['employee_id']=df['employee_id'].str.replace("_","",regex=False)
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,IT,Senior Analyst,60,85000,NaT,01/04/2021,5,3,NaN
1,EMP1,IT,Analyst,NaN,55000,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000,NaT,2022-03-01,3,4,NaN
3,EMP1003,it,Analyst,45,35000,NaT,01/04/2021,1,3,NaN
4,NaN,IT,mgr,150,85000,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,IT,Analyst,35,250000,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000,2021-07-15,invalid,3,excellent,yes
998,EMP998,Finance,NaN,60,85000,2019-05-10,NaN,12,NaN,True
999,EMP1999,it,Manager,150,₹75000,NaT,2022-03-01,ten,5,yes

In [10]:
print(df["employee_id"].value_counts())

employee_id
EMP1000    1
EMP638     1
EMP663     1
EMP660     1
EMP659     1
          ..
EMP1323    1
EMP317     1
EMP316     1
EMP315     1
EMP1999    1
Name: count, Length: 496, dtype: int64

## 3. Standardize department and calculate the average salary per department 
excluding invalid salaries.

In [11]:
df['department'].unique()

array(['IT', 'Sales', 'it ', 'HR ', 'sales', 'Finance', nan, 'HR'],
      dtype=object)

In [12]:
df['department']=df['department'].str.title().str.strip()
df["department"].unique()

array(['It', 'Sales', 'Hr', 'Finance', nan], dtype=object)

In [13]:
len(df['department'])

1000

In [14]:
len(df['salary'])

1000

In [15]:
df['salary'].unique()

array(['85000', '55000', '35000', '₹75000', '120000', nan, '250000'],
      dtype=object)

In [16]:
df['salary']=df['salary'].str.replace("₹","")

In [17]:
df['salary'].unique()

array(['85000', '55000', '35000', '75000', '120000', nan, '250000'],
      dtype=object)

In [18]:
df['salary']=pd.to_numeric(df['salary'])

In [19]:
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,It,Senior Analyst,60,85000.0,NaT,01/04/2021,5,3,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28,85000.0,NaT,2022-03-01,3,4,NaN
3,EMP1003,It,Analyst,45,35000.0,NaT,01/04/2021,1,3,NaN
4,NaN,It,mgr,150,85000.0,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60,55000.0,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,It,Analyst,35,250000.0,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150,250000.0,2021-07-15,invalid,3,excellent,yes
998,EMP998,Finance,NaN,60,85000.0,2019-05-10,NaN,12,NaN,True
999,EMP1999,It,Manager,150,75000.0,NaT,2022-03-01,ten,5,yes

In [20]:
df.groupby('department')['salary'].mean()

department
Finance    107397.959184
Hr         110117.647059
It         103373.205742
Sales      110842.696629
Name: salary, dtype: float64

## 4. Convert age to numeric and find employees with valid salary but invalid age

In [21]:
df['age'].unique()

array(['60', nan, '28', '45', '150', '35', '22', '-5', 'unknown'],
      dtype=object)

In [22]:
df['age']=pd.to_numeric(df['age'],errors='coerce')
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,01/04/2021,5,3,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,2022-03-01,3,4,NaN
3,EMP1003,It,Analyst,45.0,35000.0,NaT,01/04/2021,1,3,NaN
4,NaN,It,mgr,150.0,85000.0,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,It,Analyst,35.0,250000.0,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,excellent,yes
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaN,12,NaN,True
999,EMP1999,It,Manager,150.0,75000.0,NaT,2022-03-01,ten,5,yes

In [23]:
df['age'].unique()

array([ 60.,  nan,  28.,  45., 150.,  35.,  22.,  -5.])

In [24]:
df['salary'].unique()

array([ 85000.,  55000.,  35000.,  75000., 120000.,     nan, 250000.])

In [25]:
k=df[((df['age']==-5) | (df['age']>100) | (df['age'].isna())) & df['salary'].notna() ] 
k

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,invalid,5,3,True
4,NaN,It,mgr,150.0,85000.0,NaT,invalid,12,2,True
5,NaN,It,mgr,NaN,75000.0,2019-05-10,invalid,8,3,no
8,EMP1008,Finance,ANALYST,150.0,35000.0,2021-07-15,NaN,NaN,excellent,True
10,EMP10,Finance,Analyst,-5.0,35000.0,NaT,NaN,8,1,no
...,...,...,...,...,...,...,...,...,...,...
990,EMP990,NaN,Senior Analyst,-5.0,85000.0,2019-05-10,01/04/2021,12,5,yes
991,NaN,It,Analyst,NaN,120000.0,2020-06-10,2022-03-01,-2,4,yes
994,EMP1994,Sales,NaN,-5.0,85000.0,2019-05-10,2022-03-01,12,1,True
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,excellent,yes
999,EMP1999,It,Manager,150.0,75000.0,NaT,2022-03-01,ten,5,yes

## 5. Clean salary and detect outliers using the IQR method

In [26]:
df['salary'].unique()

array([ 85000.,  55000.,  35000.,  75000., 120000.,     nan, 250000.])

In [27]:
q1=df['age'].quantile(0.25)
q3=df['age'].quantile(0.75)
iqr=q3-q1
outliers=df[(df['age']<q1-1.5*iqr)|(df['age']>q3+1.5*iqr)]
outliers

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
4,NaN,It,mgr,150.0,85000.0,NaT,invalid,12,2,True
8,EMP1008,Finance,ANALYST,150.0,35000.0,2021-07-15,NaN,NaN,excellent,True
14,NaN,It,Analyst,150.0,75000.0,2019-05-10,01/04/2021,-2,2,yes
15,EMP15,NaN,Senior Analyst,150.0,NaN,2020-06-10,NaN,8,1,NaN
81,EMP1081,Sales,Analyst,150.0,75000.0,2020-06-10,NaN,5,5,yes
...,...,...,...,...,...,...,...,...,...,...
971,EMP971,It,Analyst,150.0,NaN,2019-05-10,2022-03-01,1,5,yes
983,EMP1983,Hr,mgr,150.0,NaN,NaT,01/04/2021,1,1,False
987,EMP1987,Sales,ANALYST,150.0,120000.0,2021-07-15,invalid,NaN,4,no
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,excellent,yes
999,EMP1999,It,Manager,150.0,75000.0,NaT,2022-03-01,ten,5,yes

## 6. Convert performance_rating into numeric and calculate the median rating per 
designation.

In [28]:
df['designation'].unique()

array(['Senior Analyst', 'Analyst', nan, 'mgr', 'ANALYST', 'Manager'],
      dtype=object)

In [29]:
df['designation']=df['designation'].str.strip().str.title()
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,01/04/2021,5,3,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,invalid,5,3,True
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,2022-03-01,3,4,NaN
3,EMP1003,It,Analyst,45.0,35000.0,NaT,01/04/2021,1,3,NaN
4,NaN,It,Mgr,150.0,85000.0,NaT,invalid,12,2,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,2022-03-01,1,4,yes
996,EMP1996,It,Analyst,35.0,250000.0,NaT,invalid,-2,5,NaN
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,excellent,yes
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaN,12,NaN,True
999,EMP1999,It,Manager,150.0,75000.0,NaT,2022-03-01,ten,5,yes

In [30]:
df['designation'].unique()

array(['Senior Analyst', 'Analyst', nan, 'Mgr', 'Manager'], dtype=object)

In [31]:
df['performance_rating'].unique()

array(['3', '4', '2', 'poor', '1', 'excellent', '5', nan], dtype=object)

In [32]:
df['performance_rating']=df['performance_rating'].replace("poor","1").replace("excellent","5")
df['performance_rating']=pd.to_numeric(df['performance_rating'])
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,01/04/2021,5,3.0,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,invalid,5,3.0,True
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,2022-03-01,3,4.0,NaN
3,EMP1003,It,Analyst,45.0,35000.0,NaT,01/04/2021,1,3.0,NaN
4,NaN,It,Mgr,150.0,85000.0,NaT,invalid,12,2.0,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,2022-03-01,1,4.0,yes
996,EMP1996,It,Analyst,35.0,250000.0,NaT,invalid,-2,5.0,NaN
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,invalid,3,5.0,yes
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaN,12,NaN,True
999,EMP1999,It,Manager,150.0,75000.0,NaT,2022-03-01,ten,5.0,yes

In [33]:
df.groupby(df['designation'])['performance_rating'].median()

designation
Analyst           3.0
Manager           3.0
Mgr               3.0
Senior Analyst    3.0
Name: performance_rating, dtype: float64

## 7. Identify employees whose last_promotion_date is earlier than their joining_date.

In [34]:
df['last_promotion_date'].unique()

array(['01/04/2021', 'invalid', '2022-03-01', nan], dtype=object)

In [35]:
df['last_promotion_date']=pd.to_datetime(df['last_promotion_date'],errors='coerce',dayfirst=True)
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5,3.0,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,NaT,5,3.0,True
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,NaT,3,4.0,NaN
3,EMP1003,It,Analyst,45.0,35000.0,NaT,2021-04-01,1,3.0,NaN
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12,2.0,True
...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1,4.0,yes
996,EMP1996,It,Analyst,35.0,250000.0,NaT,NaT,-2,5.0,NaN
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3,5.0,yes
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12,NaN,True
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,ten,5.0,yes

In [36]:
df['last_promotion_date'].unique()

<DatetimeArray>
['2021-04-01 00:00:00', 'NaT']
Length: 2, dtype: datetime64[ns]

In [37]:
k=df[(df['last_promotion_date']<df['joining_date'])]
k

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
24,EMP1024,Finance,Mgr,35.0,85000.0,2021-07-15,2021-04-01,8,3.0,True
40,EMP40,NaN,NaN,60.0,85000.0,2021-07-15,2021-04-01,12,5.0,True
44,EMP44,Sales,Mgr,45.0,75000.0,2021-07-15,2021-04-01,8,2.0,True
47,NaN,Finance,Analyst,NaN,250000.0,2021-07-15,2021-04-01,3,5.0,True
71,EMP71,Sales,Manager,60.0,250000.0,2021-07-15,2021-04-01,12,5.0,False
82,EMP82,Sales,Senior Analyst,150.0,NaN,2021-07-15,2021-04-01,-2,1.0,yes
85,NaN,Sales,NaN,60.0,55000.0,2021-07-15,2021-04-01,NaN,2.0,yes
124,NaN,Sales,Analyst,NaN,250000.0,2021-07-15,2021-04-01,1,5.0,no
138,EMP138,Finance,Mgr,45.0,250000.0,2021-07-15,2021-04-01,NaN,3.0,False
169,EMP169,It,Mgr,60.0,120000.0,2021-07-15,2021-04-01,NaN,2.0,NaN
187,NaN,NaN,Analyst,150.0,250000.0,2021-07-15,2021-04-01,12,4.0,no
191,EMP1191,Sales,Mgr,NaN,NaN,2021-07-15,2021-04-01,NaN,NaN,yes
200,NaN,Sales,Mgr,22.0,35000.0,2021-07-15,2021-04-01,NaN,2.0,no
243,NaN,Sales,Mgr,NaN,NaN,2021-07-15,2021-04-01,5,NaN,NaN
247,NaN,Hr,Senior Analyst,-5.0,250000.0,2021-07-15,2021-04-01,-2,3.0,True
269,NaN,Hr,Mgr,NaN,NaN,2021-07-15,2021-04-01,ten,1.0,no
275,NaN,NaN,Analyst,45.0,NaN,2021-07-15,2021-04-01,1,5.0,False
293,EMP1293,Hr,NaN,60.0,NaN,2021-07-15,2021-04-01,8,5.0,NaN
331,EMP331,Finance,Analyst,150.0,NaN,2021-07-15,2021-04-01,8,2.0,yes
360,EMP360,Hr,NaN,150.0,85000.0,2021-07-15,2021-04-01,3,1.0,False
371,NaN,Sales,Manager,60.0,250000.0,2021-07-15,2021-04-01,3,3.0,False
379,EMP1379,Finance,Senior Analyst,-5.0,NaN,2021-07-15,2021-04-01,8,5.0,yes
390,EMP390,NaN,Mgr,60.0,35000.0,2021-07-15,2021-04-01,8,5.0,no
416,NaN,Hr,Mgr,45.0,120000.0,2021-07-15,2021-04-01,1,NaN,False
423,NaN,Hr,NaN,NaN,NaN,2021-07-15,2021-04-01,12,2.0,False
482,EMP482,Finance,NaN,22.0,85000.0,2021-07-15,2021-04-01,5,1.0,False
499,EMP1499,Sales,Analyst,NaN,55000.0,2021-07-15,2021-04-01,NaN,NaN,NaN
508,NaN,Hr,Analyst,60.0,85000.0,2021-07-15,2021-04-01,8,1.0,True
513,NaN,It,Mgr,45.0,85000.0,2021-07-15,2021-04-01,12,4.0,NaN
538,EMP1538,NaN,Mgr,60.0,NaN,2021-07-15,2021-04-01,1,3.0,True
548,NaN,It,Manager,60.0,35000.0,2021-07-15,2021-04-01,NaN,1.0,no
556,NaN,Hr,Senior Analyst,NaN,35000.0,2021-07-15,2021-04-01,8,3.0,NaN
576,NaN,It,Analyst,NaN,250000.0,2021-07-15,2021-04-01,1,2.0,NaN
578,NaN,Hr,Analyst,45.0,NaN,2021-07-15,2021-04-01,3,5.0,yes
590,NaN,Finance,Mgr,NaN,55000.0,2021-07-15,2021-04-01,8,2.0,True
607,NaN,Sales,Analyst,-5.0,NaN,2021-07-15,2021-04-01,NaN,4.0,yes
651,EMP651,It,Senior Analyst,NaN,NaN,2021-07-15,2021-04-01,8,5.0,True
663,EMP663,It,Senior Analyst,28.0,NaN,2021-07-15,2021-04-01,3,NaN,NaN
697,EMP697,Sales,Senior Analyst,35.0,250000.0,2021-07-15,2021-04-01,12,NaN,True
722,EMP1722,It,Manager,22.0,NaN,2021-07-15,2021-04-01,12,4.0,no
739,EMP1739,Sales,NaN,45.0,75000.0,2021-07-15,2021-04-01,NaN,1.0,yes
752,NaN,It,Analyst,60.0,250000.0,2021-07-15,2021-04-01,3,1.0,True
772,NaN,Hr,Mgr,60.0,55000.0,2021-07-15,2021-04-01,1,4.0,True
781,NaN,Hr,Manager,45.0,85000.0,2021-07-15,2021-04-01,5,4.0,False
833,NaN,Finance,Analyst,NaN,35000.0,2021-07-15,2021-04-01,-2,3.0,NaN
838,EMP838,NaN,Analyst,60.0,35000.0,2021-07-15,2021-04-01,ten,1.0,True
851,EMP1851,Finance,Analyst,NaN,NaN,2021-07-15,2021-04-01,12,4.0,True
861,EMP861,NaN,NaN,60.0,NaN,2021-07-15,2021-04-01,12,1.0,NaN
877,NaN,Sales,Analyst,NaN,120000.0,2021-07-15,2021-04-01,1,1.0,True
974,EMP974,NaN,Mgr,NaN,85000.0,2021-07-15,2021-04-01,3,4.0,False

## 8. Clean experience_years and find mismatches where experience exceeds employee age.

In [38]:
df['experience_years'].unique()

array(['5', '3', '1', '12', '8', '-2', nan, 'ten'], dtype=object)

In [39]:
df['experience_years']=df['experience_years'].replace('ten','10').replace("-2",np.nan)

In [40]:
df['experience_years'].unique()

array(['5', '3', '1', '12', '8', nan, '10'], dtype=object)

In [41]:
df['experience_years']=pd.to_numeric(df['experience_years'])

In [42]:
ans=df[df['experience_years']>df['age']]
ans

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
10,EMP10,Finance,Analyst,-5.0,35000.0,NaT,NaT,8.0,1.0,no
17,EMP17,Sales,Senior Analyst,-5.0,NaN,NaT,2021-04-01,3.0,4.0,False
43,NaN,It,Manager,-5.0,120000.0,NaT,NaT,1.0,5.0,NaN
49,NaN,It,Mgr,-5.0,55000.0,2021-07-15,NaT,5.0,3.0,False
56,NaN,Hr,NaN,-5.0,NaN,2020-06-10,NaT,8.0,NaN,no
...,...,...,...,...,...,...,...,...,...,...
945,NaN,Hr,Manager,-5.0,35000.0,2020-06-10,2021-04-01,3.0,NaN,True
949,EMP949,It,NaN,-5.0,55000.0,NaT,NaT,5.0,1.0,no
965,NaN,Sales,Mgr,-5.0,NaN,2020-06-10,NaT,12.0,1.0,no
990,EMP990,NaN,Senior Analyst,-5.0,85000.0,2019-05-10,2021-04-01,12.0,5.0,yes
994,EMP1994,Sales,NaN,-5.0,85000.0,2019-05-10,NaT,12.0,1.0,True

## 9. Standardize designation and count how many active employees are in each designation.

In [43]:
df['designation'].unique()

array(['Senior Analyst', 'Analyst', nan, 'Mgr', 'Manager'], dtype=object)

In [44]:
df['is_active'].unique()

array([nan, 'True', 'no', 'yes', 'False'], dtype=object)

In [45]:
df['is_active']=df['is_active'].replace("True",True).replace("yes",True).replace("False",False).replace("no",False)

In [46]:
df['is_active'].unique()

array([nan, True, False], dtype=object)

In [47]:
df.groupby(df['designation'])['is_active'].value_counts()

designation     is_active
Analyst         True         122
                False        114
Manager         True          68
                False         61
Mgr             True          82
                False         65
Senior Analyst  True          88
                False         71
Name: count, dtype: int64

## 10.Convert is_active to boolean and find inactive employees with recent promotions.

In [48]:
df['is_active']=df['is_active'].astype('boolean')

In [49]:
df['is_active'].unique()

<BooleanArray>
[<NA>, True, False]
Length: 3, dtype: boolean

In [50]:
df['last_promotion_date'].unique()

<DatetimeArray>
['2021-04-01 00:00:00', 'NaT']
Length: 2, dtype: datetime64[ns]

In [51]:
df[(df['is_active']==False) & (df['last_promotion_date']=='2021-04-01 00:00:00')]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active
17,EMP17,Sales,Senior Analyst,-5.0,NaN,NaT,2021-04-01,3.0,4.0,False
70,EMP1070,Sales,NaN,35.0,NaN,NaT,2021-04-01,5.0,2.0,False
71,EMP71,Sales,Manager,60.0,250000.0,2021-07-15,2021-04-01,12.0,5.0,False
79,EMP79,NaN,Manager,NaN,NaN,2019-05-10,2021-04-01,8.0,1.0,False
91,EMP91,NaN,Manager,35.0,55000.0,2020-06-10,2021-04-01,3.0,1.0,False
...,...,...,...,...,...,...,...,...,...,...
966,NaN,It,Analyst,45.0,NaN,2020-06-10,2021-04-01,1.0,NaN,False
967,NaN,NaN,NaN,22.0,85000.0,NaT,2021-04-01,12.0,1.0,False
973,NaN,It,NaN,60.0,NaN,NaT,2021-04-01,5.0,1.0,False
974,EMP974,NaN,Mgr,NaN,85000.0,2021-07-15,2021-04-01,3.0,4.0,False
983,EMP1983,Hr,Mgr,150.0,NaN,NaT,2021-04-01,1.0,1.0,False

## 11.Calculate employee tenure in years and find those with tenure above the 70th percentile.

In [52]:
today=pd.Timestamp.today()
df['tenure_years']=((today-df['joining_date']).dt.days/365).round(2)
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5.0,3.0,<NA>,NaN
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,NaT,5.0,3.0,True,5.68
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,<NA>,NaN
3,EMP1003,It,Analyst,45.0,35000.0,NaT,2021-04-01,1.0,3.0,<NA>,NaN
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.76
996,EMP1996,It,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,<NA>,NaN
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.58
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN

In [53]:
df[df['tenure_years']>df['tenure_years'].quantile(0.70)]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years
5,NaN,It,Mgr,NaN,75000.0,2019-05-10,NaT,8.0,3.0,False,6.76
14,NaN,It,Analyst,150.0,75000.0,2019-05-10,2021-04-01,NaN,2.0,True,6.76
26,NaN,Finance,Senior Analyst,28.0,75000.0,2019-05-10,NaT,8.0,5.0,True,6.76
29,NaN,Finance,Mgr,28.0,55000.0,2019-05-10,NaT,10.0,4.0,True,6.76
30,EMP1030,Hr,Manager,NaN,85000.0,2019-05-10,NaT,3.0,3.0,True,6.76
...,...,...,...,...,...,...,...,...,...,...,...
980,EMP1980,It,Manager,45.0,NaN,2019-05-10,2021-04-01,NaN,5.0,<NA>,6.76
990,EMP990,NaN,Senior Analyst,-5.0,85000.0,2019-05-10,2021-04-01,12.0,5.0,True,6.76
994,EMP1994,Sales,NaN,-5.0,85000.0,2019-05-10,NaT,12.0,1.0,True,6.76
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.76
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76

## 12.Identify departments where more than 25% of salary values are missing or invalid.

In [54]:
df.groupby('department')['salary'].apply(lambda x: (x.isna() | (x <= 0)).mean()).loc[lambda x: x > 0.25]

department
Finance    0.251908
Sales      0.261411
Name: salary, dtype: float64

## 13.Create a flag for employees with high performance (≥4) but below-median salary.

In [55]:
m=df['salary'].median()
m

85000.0

In [56]:
df['flag']=(df['performance_rating']>=4)&(df['salary']<m)
df['flag'].value_counts()

flag
False    881
True     119
Name: count, dtype: int64

In [57]:
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5.0,3.0,<NA>,NaN,False
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,NaT,5.0,3.0,True,5.68,False
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,<NA>,NaN,False
3,EMP1003,It,Analyst,45.0,35000.0,NaT,2021-04-01,1.0,3.0,<NA>,NaN,False
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.76,True
996,EMP1996,It,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,<NA>,NaN,False
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.58,False
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76,False
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN,True

## 14.Detect employees with no promotion date but more than 5 years of experience.

In [58]:
df[(df['last_promotion_date'].isna())&(df['experience_years']>5)]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN,False
5,NaN,It,Mgr,NaN,75000.0,2019-05-10,NaT,8.0,3.0,False,6.76,False
6,NaN,Hr,NaN,35.0,120000.0,2020-06-10,NaT,12.0,1.0,<NA>,5.68,False
10,EMP10,Finance,Analyst,-5.0,35000.0,NaT,NaT,8.0,1.0,False,NaN,False
12,EMP12,Sales,Analyst,60.0,75000.0,NaT,NaT,8.0,NaN,<NA>,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...
978,EMP1978,Hr,Senior Analyst,28.0,75000.0,2020-06-10,NaT,8.0,1.0,True,5.68,False
993,EMP1993,Sales,NaN,35.0,120000.0,2020-06-10,NaT,12.0,NaN,False,5.68,False
994,EMP1994,Sales,NaN,-5.0,85000.0,2019-05-10,NaT,12.0,1.0,True,6.76,False
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76,False
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN,True

## 15.Build a validation rule to flag rows violating at least two business constraints

In [59]:
rules = pd.DataFrame({
    'age': (df['age'] < 18) | (df['age'] > 60) | df['age'].isna(),
    'salary': df['salary'].isna() | (df['salary'] <= 0),
    'perf_salary': (
        (df['performance_rating'] < 3) &
        (df['salary'] > df['salary'].median()) &
        df['salary'].notna()
    )
})
df['flag_violate_2_plus'] = rules.sum(axis=1) >= 2
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5.0,3.0,<NA>,NaN,False,False
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,NaT,5.0,3.0,True,5.68,False,False
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,<NA>,NaN,False,False
3,EMP1003,It,Analyst,45.0,35000.0,NaT,2021-04-01,1.0,3.0,<NA>,NaN,False,False
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.76,True,False
996,EMP1996,It,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,<NA>,NaN,False,False
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.58,False,False
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76,False,False
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN,True,False

## 16) After cleaning dates, find employees whose promotion gap (promotion date − 
joining date) is less than 1 year.

In [60]:
df[(df['last_promotion_date'] - df['joining_date']).dt.days < 365]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus
9,EMP1009,It,NaN,22.0,120000.0,2020-06-10,2021-04-01,NaN,4.0,<NA>,5.68,False,False
24,EMP1024,Finance,Mgr,35.0,85000.0,2021-07-15,2021-04-01,8.0,3.0,True,4.58,False,False
40,EMP40,NaN,NaN,60.0,85000.0,2021-07-15,2021-04-01,12.0,5.0,True,4.58,False,False
44,EMP44,Sales,Mgr,45.0,75000.0,2021-07-15,2021-04-01,8.0,2.0,True,4.58,False,False
47,NaN,Finance,Analyst,NaN,250000.0,2021-07-15,2021-04-01,3.0,5.0,True,4.58,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
943,EMP1943,Finance,Mgr,45.0,35000.0,2020-06-10,2021-04-01,NaN,NaN,<NA>,5.68,False,False
945,NaN,Hr,Manager,-5.0,35000.0,2020-06-10,2021-04-01,3.0,NaN,True,5.68,False,False
966,NaN,It,Analyst,45.0,NaN,2020-06-10,2021-04-01,1.0,NaN,False,5.68,False,False
974,EMP974,NaN,Mgr,NaN,85000.0,2021-07-15,2021-04-01,3.0,4.0,False,4.58,False,False
975,NaN,NaN,Senior Analyst,28.0,55000.0,2020-06-10,2021-04-01,NaN,NaN,True,5.68,False,False

## 17) Identify employees whose salary is above the department average but performance rating is below the department median.

In [61]:
df.dtypes

employee_id                    object
department                     object
designation                    object
age                           float64
salary                        float64
joining_date           datetime64[ns]
last_promotion_date    datetime64[ns]
experience_years              float64
performance_rating            float64
is_active                     boolean
tenure_years                  float64
flag                             bool
flag_violate_2_plus              bool
dtype: object

In [62]:
k=df.groupby(df['department'])['salary'].mean()
k

department
Finance    107397.959184
Hr         110117.647059
It         103373.205742
Sales      110842.696629
Name: salary, dtype: float64

In [63]:
m=df.groupby(df['department'])['performance_rating'].median()
m

department
Finance    3.0
Hr         3.0
It         3.0
Sales      3.0
Name: performance_rating, dtype: float64

In [64]:
df[(df['department'].notna())&(df['salary']>df['department'].map(k))&(df['performance_rating']<df['department'].map(m))]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus
6,NaN,Hr,NaN,35.0,120000.0,2020-06-10,NaT,12.0,1.0,<NA>,5.68,False,False
16,NaN,It,NaN,60.0,250000.0,NaT,NaT,12.0,1.0,False,NaN,False,False
45,NaN,Finance,NaN,NaN,120000.0,NaT,2021-04-01,1.0,1.0,True,NaN,False,True
69,EMP1069,It,NaN,45.0,250000.0,NaT,NaT,10.0,1.0,<NA>,NaN,False,False
115,EMP115,Sales,Analyst,28.0,250000.0,2021-07-15,NaT,NaN,2.0,False,4.58,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
939,NaN,It,NaN,28.0,120000.0,NaT,NaT,10.0,1.0,False,NaN,False,False
957,NaN,Sales,Analyst,35.0,120000.0,2020-06-10,NaT,8.0,1.0,False,5.68,False,False
968,EMP968,It,Manager,22.0,120000.0,2021-07-15,NaT,5.0,1.0,True,4.58,False,False
976,EMP1976,Hr,Analyst,NaN,250000.0,2019-05-10,NaT,1.0,1.0,False,6.76,False,True
989,NaN,Hr,Analyst,45.0,120000.0,NaT,NaT,3.0,1.0,True,NaN,False,False

## 18) Create a column that categorizes employees into age bands (Young, Mid, Senior) and count employees per band per department.

In [65]:
def solve(age):
    if pd.isna(age):
        return np.nan
    elif 18 <= age <= 25:
        return 'young'
    elif 26 <= age <= 40:
        return 'mid'
    elif 41 <= age <= 60:
        return 'senior'
    else:
        return np.nan


df['age_bands']=df['age'].apply(solve)
df

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus,age_bands
0,EMP1000,It,Senior Analyst,60.0,85000.0,NaT,2021-04-01,5.0,3.0,<NA>,NaN,False,False,senior
1,EMP1,It,Analyst,NaN,55000.0,2020-06-10,NaT,5.0,3.0,True,5.68,False,False,NaN
2,EMP1002,Sales,NaN,28.0,85000.0,NaT,NaT,3.0,4.0,<NA>,NaN,False,False,mid
3,EMP1003,It,Analyst,45.0,35000.0,NaT,2021-04-01,1.0,3.0,<NA>,NaN,False,False,senior
4,NaN,It,Mgr,150.0,85000.0,NaT,NaT,12.0,2.0,True,NaN,False,False,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,EMP1995,Finance,NaN,60.0,55000.0,2019-05-10,NaT,1.0,4.0,True,6.76,True,False,senior
996,EMP1996,It,Analyst,35.0,250000.0,NaT,NaT,NaN,5.0,<NA>,NaN,False,False,mid
997,EMP1997,Sales,Senior Analyst,150.0,250000.0,2021-07-15,NaT,3.0,5.0,True,4.58,False,False,NaN
998,EMP998,Finance,NaN,60.0,85000.0,2019-05-10,NaT,12.0,NaN,True,6.76,False,False,senior
999,EMP1999,It,Manager,150.0,75000.0,NaT,NaT,10.0,5.0,True,NaN,True,False,NaN

In [66]:
df.groupby(df['department'])['age_bands'].value_counts()

department  age_bands
Finance     mid          31
            senior       28
            young        18
Hr          mid          60
            senior       48
            young        20
It          senior       79
            mid          63
            young        26
Sales       senior       58
            mid          52
            young        20
Name: count, dtype: int64

## 19) Find departments where the average experience is higher than the company-wide average experience.

In [67]:
avg= df['experience_years'].mean()
dept_avg_exp = df.groupby('department')['experience_years'].mean()
result=dept_avg_exp[dept_avg_exp>avg]
result

department
Sales    6.72093
Name: experience_years, dtype: float64

## 20) Detect employees marked as inactive but having a valid promotion date within the last 2 years

In [ ]:
df[(df['is_active']==False) & (df['last_promotion_date'] >= (pd.Timestamp.today() - pd.DateOffset(years=2)))]

Empty DataFrame
Columns: [employee_id, department, designation, age, salary, joining_date, last_promotion_date, experience_years, performance_rating, is_active, tenure_years, flag, flag_violate_2_plus, age_bands]
Index: []

## 21) Identify designations where more than 20% of employees have missing or invalid experience values.

In [ ]:
df.groupby('designation')['experience_years'].apply(lambda x: (x.isna() | (x <= 0)).mean()).loc[lambda x: x > 0.20]

designation
Analyst    0.265372
Manager    0.240506
Mgr        0.337079
Name: experience_years, dtype: float64

## 22) Calculate the ratio of salary to experience years and detect extreme values using the 95th percentile.

In [70]:
## 22) Calculate the ratio of salary to experience years and detect extreme values using the 95th percentile.
df['salary_to_experience'] = df['salary'] / df['experience_years']
percentile_95 = df['salary_to_experience'].quantile(0.95)
extreme_values = df[df['salary_to_experience'] > percentile_95]
extreme_values

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus,age_bands,salary_to_experience
124,NaN,Sales,Analyst,NaN,250000.0,2021-07-15,2021-04-01,1.0,5.0,False,4.58,False,False,NaN,250000.0
133,NaN,It,NaN,-5.0,250000.0,2021-07-15,NaT,1.0,5.0,True,4.58,False,False,NaN,250000.0
176,NaN,It,Analyst,22.0,250000.0,NaT,NaT,1.0,NaN,False,NaN,False,False,young,250000.0
224,NaN,Finance,Manager,60.0,250000.0,2021-07-15,NaT,1.0,3.0,<NA>,4.58,False,False,senior,250000.0
262,NaN,It,Manager,-5.0,250000.0,NaT,NaT,1.0,5.0,<NA>,NaN,False,False,NaN,250000.0
399,NaN,Finance,Analyst,60.0,250000.0,NaT,NaT,1.0,3.0,True,NaN,False,False,senior,250000.0
401,EMP1401,Finance,Analyst,22.0,250000.0,NaT,NaT,1.0,1.0,<NA>,NaN,False,False,young,250000.0
470,EMP1470,Hr,Mgr,35.0,250000.0,2021-07-15,NaT,1.0,5.0,True,4.58,False,False,mid,250000.0
525,EMP525,Sales,Manager,-5.0,250000.0,2020-06-10,NaT,1.0,1.0,False,5.68,False,True,NaN,250000.0
529,EMP529,NaN,NaN,28.0,250000.0,2020-06-10,NaT,1.0,5.0,False,5.68,False,False,mid,250000.0
576,NaN,It,Analyst,NaN,250000.0,2021-07-15,2021-04-01,1.0,2.0,<NA>,4.58,False,True,NaN,250000.0
667,EMP667,Hr,Manager,28.0,250000.0,NaT,NaT,1.0,2.0,True,NaN,False,False,mid,250000.0
821,EMP821,NaN,Manager,NaN,250000.0,NaT,NaT,1.0,2.0,True,NaN,False,True,NaN,250000.0
848,NaN,Hr,Senior Analyst,28.0,250000.0,2021-07-15,NaT,1.0,2.0,False,4.58,False,False,mid,250000.0
862,NaN,Sales,Manager,NaN,250000.0,NaT,NaT,1.0,4.0,True,NaN,False,False,NaN,250000.0
976,EMP1976,Hr,Analyst,NaN,250000.0,2019-05-10,NaT,1.0,1.0,False,6.76,False,True,NaN,250000.0

## 23) Find employees whose age is valid but inconsistent with experience (experience >age − 18).

In [ ]:
df[df['experience_years'] > (df['age'] - 18)]

,employee_id,department,designation,age,salary,joining_date,last_promotion_date,experience_years,performance_rating,is_active,tenure_years,flag,flag_violate_2_plus,age_bands,salary_to_experience
10,EMP10,Finance,Analyst,-5.0,35000.0,NaT,NaT,8.0,1.0,False,NaN,False,False,NaN,4375.000000
17,EMP17,Sales,Senior Analyst,-5.0,NaN,NaT,2021-04-01,3.0,4.0,False,NaN,False,True,NaN,NaN
19,NaN,It,Mgr,22.0,120000.0,NaT,NaT,10.0,4.0,True,NaN,False,False,young,12000.000000
42,EMP1042,Hr,Manager,22.0,35000.0,NaT,NaT,10.0,2.0,True,NaN,False,False,young,3500.000000
43,NaN,It,Manager,-5.0,120000.0,NaT,NaT,1.0,5.0,<NA>,NaN,False,False,NaN,120000.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
965,NaN,Sales,Mgr,-5.0,NaN,2020-06-10,NaT,12.0,1.0,False,5.68,False,True,NaN,NaN
967,NaN,NaN,NaN,22.0,85000.0,NaT,2021-04-01,12.0,1.0,False,NaN,False,False,young,7083.333333
968,EMP968,It,Manager,22.0,120000.0,2021-07-15,NaT,5.0,1.0,True,4.58,False,False,young,24000.000000
990,EMP990,NaN,Senior Analyst,-5.0,85000.0,2019-05-10,2021-04-01,12.0,5.0,True,6.76,False,False,NaN,7083.333333
994,EMP1994,Sales,NaN,-5.0,85000.0,2019-05-10,NaT,12.0,1.0,True,6.76,False,False,NaN,7083.333333

## 24) Compute department-wise attrition rate assuming inactive employees represent attrition.

In [73]:
attrition_rate = df.groupby('department')['is_active'].apply(lambda x: (x == False).mean())
attrition_rate

department
Finance    0.425743
Hr         0.446927
It         0.469484
Sales      0.517588
Name: is_active, dtype: float64

## 25)Create a final quality score per row based on number of valid fields and flag rows below a quality threshold.

In [ ]:
def quality_score(row):
    valid_fields = 0
    total_fields = 0
    
    for col in ['age', 'salary', 'performance_rating', 'experience_years']:
        total_fields += 1
        if pd.notna(row[col]) and row[col] > 0:
            valid_fields += 1
            
    return valid_fields / total_fields if total_fields > 0 else np.nan
df['quality_score'] = df.apply(quality_score, axis=1)
quality_threshold = 0.75
df['quality_flag'] = df['quality_score'] < quality_threshold
df[['employee_id', 'quality_score', 'quality_flag']]

    employee_id  quality_score  quality_flag
0       EMP1000           1.00         False
1          EMP1           0.75         False
2       EMP1002           1.00         False
3       EMP1003           1.00         False
4           NaN           1.00         False
..          ...            ...           ...
995     EMP1995           1.00         False
996     EMP1996           0.75         False
997     EMP1997           1.00         False
998      EMP998           0.75         False
999     EMP1999           1.00         False

[1000 rows x 3 columns]